montag,days
dienstag,days
mittwoch,days
donnerstag,days
freitag,days
samstag,days
sonntag,days
wochenende,days
januar,months
februar,months
maerz,months
april,months
mai,months
juni,months
juli,months
august,months
september,months
oktober,months
november,months
dezember,months
was,wquestions
welche,wquestions
wo,wquestions
wann,wquestions
warum,wquestions
wer,wquestions
wem,wquestions
wessen,wquestions
wen,wquestions
woher,wquestions
schwarz,colours
grau,colours
violett,colours
weiss,colours
gruen,colours
orange,colours
rot,colours
braun,colours
hellblau,colours
blau,colours
gelb,colours
bruenett,colours
gold,colours
purpurn,colours
beige,colours
rosa,colours
tuerkis,colours
silber,colours
gross,size
breit,size
riesig,size
klein,size
winzig,size
schwer,size
leicht,size
dick,size
duenn,size
mager,size
hoch,size
niedrig,size
kurz,size
lang,size
mittelgross,size
eng,size
kugelschreiber,classroom
bleistift,classroom
spitzer,classroom
radiergummi,classroom
buch,classroom
woerterbuch,classroom
kursbuch,classroom
tisch,classroom
stuhl,classroom
tafel,classroom
fenster,classroom
tuer,classroom
kreide,classroom
schwamm,classroom
tasche,classroom
rucksack,classroom
materialmappe,classroom
notizbuch,classroom
papier,classroom
blatt,classroom
lehrer,classroom
dozent,classroom
student,classroom
studentin,classroom
schueler,classroom
schuelerin,classroom
schere,classroom
lineal,classroom
haar,bodyparts
haare,bodyparts
kopf,bodyparts
koepfe,bodyparts
auge,bodyparts
augen,bodyparts
ohr,bodyparts
ohren,bodyparts
stirn,bodyparts
nase,bodyparts
mund,bodyparts
zahn,bodyparts
zaehne,bodyparts
lippen,bodyparts
kinn,bodyparts
gesicht,bodyparts
hals,bodyparts
schulter,bodyparts
ruecken,bodyparts
arm,bodyparts
arme,bodyparts
hand,bodyparts
haende,bodyparts
bauch,bodyparts
finger,bodyparts
popo,bodyparts
popos,bodyparts
bein,bodyparts
beine,bodyparts
fuss,bodyparts
fuesse,bodyparts
gluecklich,feelings
traurig,feelings
muede,feelings
hungrig,feelings
durstig,feelings
veraergert,feelings
boese,feelings
krank,feelings
gesund,feelings
frustriert,feelings
motiviert,feelings
gestresst,feelings
nervoes,feelings
relaxt,feelings
entspannt,feelings
kalt,feelings
warm,feelings
fakultaet,university
universitaet,university
klassenraum,university
bibliothek,university
cafeteria,university
hof,university
sekretariat,university
dekanat,university
toilette,university
buero,university
flur,university
supermarkt,city
restaurant,city
baeckerei,city
apotheke,city
krankenhaus,city
rathaus,city
theater,city
kino,city
museum,city
schwimmbad,city
kirche,city
Kneipe,city
diskothek,city
geschaeft,city
einkaufszentrum,city
kindergarten,city
schule,city
lesen,freetime
spielen,freetime
zappen,freetime
lernen,freetime
studieren,freetime
trinken,freetime
essen,freetime
rauchen,freetime
tanzen,freetime
sprechen,freetime
chatten,freetime
tratschen,freetime
relaxen,freetime
fotografieren,freetime
telefonieren,freetime
schreiben,freetime
emailen,freetime
hoeren,freetime
kochen,freetime
singen,freetime
gehen,freetime
machen,freetime
schwimmen,freetime
baden,freetime
duschen,freetime
laufen,freetime
joggen,freetime
malen,freetime
fotokopieren,freetime
suchen,freetime
fragen,freetime
antworten,freetime
oeffnen,freetime
schliessen,freetime
schlafen,freetime
fahren,freetime
denken,freetime
besuchen,freetime