Montag,days
Dienstag,days
Mittwoch,days
Donnerstag,days
Freitag,days
Samstag,days
Sonntag,days
Wochenende,days
Januar,months
Februar,months
März,months
April,months
Mai,months
Juni,months
Juli,months
August,months
September,months
Oktober,months
November,months
Dezember,months
Was,wquestions
Welche,wquestions
Wo,wquestions
Wann,wquestions
Warum,wquestions
Wer,wquestions
Wem,wquestions
Wessen,wquestions
Wen,wquestions
Woher,wquestions
Schwarz,colours
Grau,colours
Violett,colours
Weiss,colours
Grün,colours
Orange,colours
Rot,colours
Braun,colours
Hellblau,colours
Blau,colours
Gelb,colours
Brünett,colours
Gold,colours
Purpurn,colours
Beige,colours
Rosa,colours
Türkis,colours
Silber,colours
Gross,size
Breit,size
Riesig,size
Klein,size
Winzig,size
Schwer,size
Leicht,size
Dick,size
Dünn,size
Mager,size
Hoch,size
Niedrig,size
Kurz,size
Lang,size
Mittelgross,size
Eng,size
Kuli,classroom
Bleistift,classroom
Spitzer,classroom
Radiergummi,classroom
Buch,classroom
Wörterbuch,classroom
Kursbuch,classroom
Tisch,classroom
Stuhl,classroom
Tafel,classroom
Fenster,classroom
Tür,classroom
Kreide,classroom
Schwamm,classroom
Tasche,classroom
Rucksack,classroom
Materialmappe,classroom
Notizbuch,classroom
Papier,classroom
Blatt,classroom
Lehrer,classroom
Dozent,classroom
Student,classroom
Studentin,classroom
Schüler,classroom
Schülerin,classroom
Schere,classroom
Lineal,classroom
Haar,bodyparts
Haare,bodyparts
Kopf,bodyparts
Auge,bodyparts
Augen,bodyparts
Ohr,bodyparts
Ohren,bodyparts
Stirn,bodyparts
Nase,bodyparts
Mund,bodyparts
Zahn,bodyparts
Zähne,bodyparts
Lippen,bodyparts
Kinn,bodyparts
Gesicht,bodyparts
Hals,bodyparts
Schulter,bodyparts
Rücken,bodyparts
Arm,bodyparts
Arme,bodyparts
Hand,bodyparts
Hände,bodyparts
Bauch,bodyparts
Finger,bodyparts
Popo,bodyparts
Popos,bodyparts
Hintern,bodyparts
Bein,bodyparts
Beine,bodyparts
Fuss,bodyparts
Füsse,bodyparts
Glücklich,feelings
Traurig,feelings
Müde,feelings
Hungrig,feelings
Durstig,feelings
Verärgert,feelings
Böse,feelings
Krank,feelings
Gesund,feelings
Frustriert,feelings
Motiviert,feelings
Gestresst,feelings
Nervös,feelings
Relaxt,feelings
Entspannt,feelings
Erkältet,feelings
Kalt,feelings
Warm,feelings
Fakultät,university
Universität,university
Klassenraum,university
Bibliothek,university
Cafeteria,university
Hof,university
Sekretariat,university
Dekanat,university
Toilette,university
Büro,university
Flur,university
Supermarkt,city
Restaurant,city
Bäckerei,city
Metzgerei,city
Apotheke,city
Krankenhaus,city
Rathaus,city
Theater,city
Kino,city
Museum,city
Schwimmbad,city
Tennisplatz,city
Fussballplatz,city
Golfplatz,city
Kirche,city
Kneipe,city
Diskothek,city
Geschäft,city
Einkaufszentrum,city
Kindergarten,city
Schule,city
Lesen,freetime
Spielen,freetime
Zappen,freetime
Lernen,freetime
Studieren,freetime
Trinken,freetime
Essen,freetime
Rauchen,freetime
Tanzen,freetime
Sprechen,freetime
Quatschen,freetime
Chatten,freetime
Tratschen,freetime
Faulenzen,freetime
Relaxen,freetime
Fotografieren,freetime
Telefonieren,freetime
Notieren,freetime
Schreiben,freetime
Grillen,freetime
Emailen,freetime
Hören,freetime
Kochen,freetime
Singen,freetime
Gehen,freetime
Machen,freetime
Schwimmen,freetime
Baden,freetime
Duschen,freetime
Laufen,freetime
Joggen,freetime
Malen,freetime
Fotokopieren,freetime
Suchen,freetime
Fragen,freetime
Antworten,freetime
Öffnen,freetime
Schliessen,freetime
Schlafen,freetime
Fahren,freetime
Denken,freetime
Besuchen,freetime
Besichtigen,freetime