
Monday,days
Tuesday,days
Wednesday,days
Thursday,days
Friday,days
Saturday,days
Sunday,days
Weekend,days
January,months
February,months
March,months
April,months
May,months
June,months
July,months
August,months
September,months
October,months
November,months
December,months
What,wquestions
Which,wquestions
Where,wquestions
When,wquestions
Why,wquestions
Who,wquestions
Whom,wquestions
Whose,wquestions
Black,colours
Grey,colours
Violet,colours
White,colours
Green,colours
Orange,colours
Red,colours
Brown,colours
Skyblue,colours
Blue,colours
Yellow,colours
Pink,colours
Purple,colours
Beige,colours
Turquoise,colours
Big,size
Large,size
Huge,size
Small,size
Tiny,size
Heavy,size
Light,size
Thick,size
Thin,size
Skinny,size
Wide,size
High,size
Low,size
Tall,size
Short,size
Long,size
Medium,size
Narrow,size
Pen,classroom
Pencil,classroom
Sharpener,classroom
Rubber,classroom
Book,classroom
Dictionary,classroom
Coursebook,classroom
Table,classroom
Chair,classroom
Blackboard,classroom
Window,classroom
Door,classroom
Chalk,classroom
Sponge,classroom
Bag,classroom
Backpack,classroom
Folder,classroom
Notebook,classroom
Paper,classroom
Sheet,classroom
Teacher,classroom
Lecturer,classroom
Student,classroom
Learner,classroom
Scissors,classroom
Ruler,classroom
Hair,bodyparts
Hairs,bodyparts
Head,bodyparts
Heads,bodyparts
Eye,bodyparts
Eyes,bodyparts
Ear,bodyparts
Ears,bodyparts
Forehead,bodyparts
Nose,bodyparts
Mouth,bodyparts
Tooth,bodyparts
Teeth,bodyparts
Lips,bodyparts
Chin,bodyparts
Face,bodyparts
Neck,bodyparts
Shoulder,bodyparts
Back,bodyparts
Arm,bodyparts
Arms,bodyparts
Hand,bodyparts
Hands,bodyparts
Belly,bodyparts
Finger,bodyparts
Bottom,bodyparts
Bottoms,bodyparts
Leg,bodyparts
Legs,bodyparts
Foot,bodyparts
Feet,bodyparts
Happy,feelings
Sad,feelings
Tired,feelings
Hungry,feelings
Thirsty,feelings
Angry,feelings
Sick,feelings
Healthy,feelings
Frustrated,feelings
Motivated,feelings
Stressed,feelings
Nervous,feelings
Relaxed,feelings
Cold,feelings
Warm,feelings
Faculty,university
University,university
Classroom,university
Library,university
Canteen,university
Courtyard,university
Secretariat,university
Denaery,university
Toilet,university
Office,university
Corridor,university
Supermarket,city
Restaurant,city
Bakery,city
Pharmacy,city
Hospital,city
Council,city
Theatre,city
Cinema,city
Museum,city
Pool,city
Church,city
Pub,city
Disco,city
Shop,city
Mall,city
Nursery,city
School,city
Read,freetime
Play,freetime
Zap,freetime
Learn,freetime
Study,freetime
Drink,freetime
Eat,freetime
Smoke,freetime
Dance,freetime
Talk,freetime
Chat,freetime
Gossip,freetime
Relax,freetime
Photograph,freetime
Telephone,freetime
Write,freetime
Email,freetime
Listen,freetime
Cook,freetime
Sing,freetime
Go,freetime
Do,freetime
Make,freetime
Swim,freetime
Bathe,freetime
Shower,freetime
Run,freetime
Jog,freetime
Paint,freetime
Photocopy,freetime
Search,freetime
Ask,freetime
Answer,freetime
Open,freetime
Close,freetime
Sleep,freetime
Drive,freetime
Think,freetime
Visit,freetime